k6-testing/results/baseline_res.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  00.6s/10s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  01.6s/10s

running (03.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  02.6s/10s

running (04.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  03.6s/10s

running (05.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  04.6s/10s

running (06.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  05.6s/10s

running (07.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  06.6s/10s

running (08.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  07.6s/10s

running (09.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  08.6s/10s

running (10.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  09.6s/10s

running (11.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s


  █ THRESHOLDS 

    checks{test_type:happy_path}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{test_type:happy_path}
    ✓ 'p(95)<200' p(95)=0s


  █ TOTAL RESULTS 

    checks_total.......: 50      4.361423/s
    checks_succeeded...: 100.00% 50 out of 50
    checks_failed......: 0.00%   0 out of 50

    ✓ status é 200 (OK)

    HTTP
    http_req_duration..............: avg=107.55ms min=21.04ms med=39.75ms max=672.35ms p(90)=433.25ms p(95)=667.52ms
      { expected_response:true }...: avg=107.55ms min=21.04ms med=39.75ms max=672.35ms p(90)=433.25ms p(95)=667.52ms
      { test_type:happy_path }.....: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_failed................: 0.00%  0 out of 51
    http_reqs......................: 51     4.448652/s

    EXECUTION
    iteration_duration.............: avg=1.1s     min=1.02s   med=1.04s   max=1.67s    p(90)=1.12s    p(95)=1.66s   
    iterations.....................: 50     4.361423/s
    vus............................: 5      min=5       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 14 kB  1.2 kB/s
    data_sent......................: 5.2 kB 458 B/s



running (11.5s), 0/5 VUs, 50 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s